Repository: timbortnik/widget
Catalog: lib/l10n/app_*.arb
Languages: be, bn, el, hi, is, ka, ko, mk, pa, ro, sq, ta, uk, vi

# appTitle
source: Meteograph
bn: আবহাওয়া চার্ট
el: Μετεωρόγραμμα
hi: मौसम चार्ट
ka: მეტეოგრამა
ko: 기상 차트
mk: Метеограм
pa: ਮੌਸਮ ਚਾਰਟ
ro: Meteogramă
sq: Meteogram
ta: வானிலை வரைபடம்
uk: Метеограма
vi: Biểu đồ thời tiết

source: Temperature
be: Тэмпература
bn: তাপমাত্রা
el: Θερμοκρασία
hi: तापमान
is: Hitastig
ka: ტემპერატურა
ko: 기온
mk: Температура
pa: ਤਾਪਮਾਨ
ro: Temperatură
sq: Temperatura
ta: வெப்பநிலை
uk: Температура
vi: Nhiệt độ

source: Precipitation
be: Ападкі
bn: বৃষ্টিপাত
el: Βροχόπτωση
hi: वर्षा
is: Úrkoma
ka: ნალექი
ko: 강수량
mk: Врнежи
pa: ਵਰਖਾ
ro: Precipitații
sq: Reshjet
ta: மழைப்பொழிவு
uk: Опади
vi: Lượng mưa

source: Cloud cover
be: Воблачнасць
bn: মেঘাচ্ছন্নতা
el: Νεφοκάλυψη
hi: बादल
is: Skýjahula
ka: ღრუბლიანობა
ko: 구름량
mk: Облачност
pa: ਬੱਦਲ
ro: Acoperire noroasă
sq: Vranësira
ta: மேக மூட்டம்
uk: Хмарність
vi: Mây che phủ

source: Now
be: Зараз
bn: এখন
el: Τώρα
hi: अभी
is: Núna
ka: ახლა
ko: 현재
mk: Сега
pa: ਹੁਣੇ
ro: Acum
sq: Tani
ta: இப்போது
uk: Зараз
vi: Hiện tại

# updatedAt
source: Updated {time}
be: Абноўлена {time}
bn: {time} আপডেট হয়েছে
el: Ενημερώθηκε {time}
hi: {time} को अपडेट किया गया
is: Uppfært {time}
ka: განახლდა {time}
ko: {time} 업데이트
mk: Ажурирано {time}
pa: {time} ਅੱਪਡੇਟ ਕੀਤਾ
ro: Actualizat {time}
sq: Përditësuar {time}
ta: {time} புதுப்பிக்கப்பட்டது
uk: Оновлено {time}
vi: Cập nhật {time}

# minutesAgo
source: {count} min ago
be: {count} хв таму
bn: {count} মিনিট আগে
el: {count} λεπτά πριν
hi: {count} मिनट पहले
is: fyrir {count} mín
ka: {count} წუთის წინ
ko: {count}분 전
mk: пред {count} мин
pa: {count} ਮਿੰਟ ਪਹਿਲਾਂ
ro: acum {count} min
sq: {count} min më parë
ta: {count} நிமிடங்கள் முன்
uk: {count} хв тому
vi: {count} phút trước

source: Just now
be: Толькі што
bn: এইমাত্র
el: Μόλις τώρα
hi: अभी-अभी
is: Rétt í þessu
ka: ახლახან
ko: 방금
mk: Токму сега
pa: ਹੁਣੇ-ਹੁਣੇ
ro: Chiar acum
sq: Pikërisht tani
ta: இப்போதுதான்
uk: Щойно
vi: Vừa xong

source: Refresh
be: Абнавіць
bn: রিফ্রেশ
el: Ανανέωση
hi: रीफ्रेश
is: Uppfæra
ka: განახლება
ko: 새로고침
mk: Освежи
pa: ਰਿਫ੍ਰੈਸ਼
ro: Reîmprospătare
sq: Rifresko
ta: புதுப்பி
uk: Оновити
vi: Làm mới

source: Settings
be: Налады
bn: সেটিংস
el: Ρυθμίσεις
hi: सेटिंग्स
is: Stillingar
ka: პარამეტრები
ko: 설정
mk: Поставки
pa: ਸੈਟਿੰਗਾਂ
ro: Setări
sq: Cilësimet
ta: அமைப்புகள்
uk: Налаштування
vi: Cài đặt

source: Location
be: Месцазнаходжанне
bn: অবস্থান
el: Τοποθεσία
hi: स्थान
is: Staðsetning
ka: მდებარეობა
ko: 위치
mk: Локација
pa: ਸਥਾਨ
ro: Locație
sq: Vendndodhja
ta: இடம்
uk: Місцезнаходження
vi: Vị trí

source: Current location
be: Бягучае месцазнаходжанне
bn: বর্তমান অবস্থান
el: Τρέχουσα τοποθεσία
hi: वर्तमान स्थान
is: Núverandi staðsetning
ka: მიმდინარე მდებარეობა
ko: 현재 위치
mk: Тековна локација
pa: ਮੌਜੂਦਾ ਸਥਾਨ
ro: Locația curentă
sq: Vendndodhja aktuale
ta: தற்போதைய இடம்
uk: Поточне місце
vi: Vị trí hiện tại

source: Set manually
be: Задаць уручную
bn: ম্যানুয়ালি সেট করুন
el: Χειροκίνητη ρύθμιση
hi: मैन्युअल सेट करें
is: Stilla handvirkt
ka: ხელით დაყენება
ko: 수동 설정
mk: Постави рачно
pa: ਹੱਥੀਂ ਸੈੱਟ ਕਰੋ
ro: Setare manuală
sq: Cakto manualisht
ta: கைமுறையாக அமை
uk: Вказати вручну
vi: Đặt thủ công

# errorNoConnection
source: No internet connection
be: Няма злучэння з інтэрнэтам
bn: ইন্টারনেট সংযোগ নেই
el: Χωρίς σύνδεση στο διαδίκτυο
hi: इंटरनेट कनेक्शन नहीं है
is: Engin nettenging
ka: ინტერნეტ კავშირი არ არის
ko: 인터넷 연결 없음
mk: Нема интернет конекција
pa: ਇੰਟਰਨੈੱਟ ਕਨੈਕਸ਼ਨ ਨਹੀਂ
ro: Fără conexiune la internet
sq: Nuk ka lidhje interneti
ta: இணைய இணைப்பு இல்லை
uk: Немає з'єднання з інтернетом
vi: Không có kết nối internet

# errorLocationUnavailable
source: Location unavailable
be: Месцазнаходжанне недаступнае
bn: অবস্থান পাওয়া যায়নি
el: Τοποθεσία μη διαθέσιμη
hi: स्थान उपलब्ध नहीं
is: Staðsetning ekki tiltæk
ka: მდებარეობა მიუწვდომელია
ko: 위치를 사용할 수 없음
mk: Локацијата е недостапна
pa: ਸਥਾਨ ਉਪਲਬਧ ਨਹੀਂ
ro: Locație indisponibilă
sq: Vendndodhja e padisponueshme
ta: இடம் கிடைக்கவில்லை
uk: Місцезнаходження недоступне
vi: Không thể xác định vị trí

# errorLoadingData
source: Could not load weather data
be: Не ўдалося загрузіць даныя надвор'я
bn: আবহাওয়ার ডেটা লোড করা যায়নি
el: Αδυναμία φόρτωσης δεδομένων καιρού
hi: मौसम डेटा लोड नहीं हो सका
is: Gat ekki hlaðið veðurgögnum
ka: ამინდის მონაცემები ვერ ჩაიტვირთა
ko: 날씨 데이터를 불러올 수 없습니다
mk: Не можеше да се вчитаат податоците за времето
pa: ਮੌਸਮ ਡਾਟਾ ਲੋਡ ਨਹੀਂ ਹੋ ਸਕਿਆ
ro: Nu s-au putut încărca datele meteo
sq: Nuk mund të ngarkoheshin të dhënat e motit
ta: வானிலை தரவை ஏற்ற முடியவில்லை
uk: Не вдалося завантажити дані погоди
vi: Không thể tải dữ liệu thời tiết

source: Retry
be: Паўтарыць
bn: পুনরায় চেষ্টা
el: Επανάληψη
hi: पुनः प्रयास
is: Reyna aftur
ka: ხელახლა ცდა
ko: 다시 시도
mk: Обиди се повторно
pa: ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼
ro: Reîncearcă
sq: Provo përsëri
ta: மீண்டும் முயற்சி
uk: Повторити
vi: Thử lại

source: OFFLINE
be: АФЛАЙН
bn: অফলাইন
el: ΕΚΤΟΣ ΣΥΝΔΕΣΗΣ
hi: ऑफलाइन
is: ÓTENGT
ka: ᲝᲤᲚᲐᲘᲜ
ko: 오프라인
mk: ОФЛАЈН
pa: ਆਫਲਾਈਨ
ta: ஆஃப்லைன்
uk: ОФЛАЙН
vi: NGOẠI TUYẾN

# forecastHours
source: {hours}-Hour Forecast
be: Прагноз на {hours} гадзін
bn: {hours} ঘণ্টার পূর্বাভাস
el: Πρόβλεψη {hours} ωρών
hi: {hours} घंटे का पूर्वानुमान
is: {hours} tíma spá
ka: {hours} საათის პროგნოზი
ko: {hours}시간 예보
mk: Прогноза за {hours} часа
pa: {hours} ਘੰਟੇ ਦੀ ਭਵਿੱਖਬਾਣੀ
ro: Prognoză {hours} ore
sq: Parashikim {hours} orë
ta: {hours} மணி நேர முன்னறிவிப்பு
uk: Прогноз на {hours} год
vi: Dự báo {hours} giờ

# maxPrecipitation
source: Max {amount}
be: Макс {amount}
bn: সর্বোচ্চ {amount}
el: Μέγ. {amount}
hi: अधिकतम {amount}
is: Hám {amount}
ka: მაქს {amount}
ko: 최대 {amount}
mk: Макс {amount}
pa: ਵੱਧ {amount}
sq: Maks {amount}
ta: அதிகபட்சம் {amount}
uk: Макс {amount}
vi: Tối đa {amount}

# maxDaylight
source: Max {percent}%
be: Макс {percent}%
bn: সর্বোচ্চ {percent}%
el: Μέγ. {percent}%
hi: अधिकतम {percent}%
is: Hám {percent}%
ko: 최대 {percent}%
mk: Макс {percent}%
pa: ਵੱਧ {percent}%
sq: Maks {percent}%
vi: Tối đa {percent}%

# precipitationRate
source: {amount} mm/h
be: {amount} мм/гадз
bn: {amount} মিমি/ঘণ্টা
el: {amount} mm/ώρα
hi: {amount} मिमी/घंटा
is: {amount} mm/klst
ka: {amount} მმ/სთ
ko: {amount} mm/시
mk: {amount} мм/ч
pa: {amount} ਮਿਮੀ/ਘੰਟਾ
sq: {amount} mm/orë
ta: {amount} மிமீ/மணி
uk: {amount} мм/год
vi: {amount} mm/giờ

# locationSourceManual
source: Manual
be: Уручную
bn: ম্যানুয়াল
el: Χειροκίνητα
hi: मैन्युअल
is: Handvirkt
ka: ხელით
ko: 수동
mk: Рачно
pa: ਹੱਥੀਂ
ta: கைமுறை
uk: Вручну
vi: Thủ công

source: Daylight
be: Дзённае святло
bn: দিনের আলো
el: Φως ημέρας
hi: दिन का प्रकाश
is: Dagsbirta
ka: დღის სინათლე
ko: 일광
mk: Дневна светлина
pa: ਦਿਨ ਦੀ ਰੌਸ਼ਨੀ
ro: Lumina zilei
sq: Drita e ditës
ta: பகல் ஒளி
uk: Денне світло
vi: Ánh sáng ban ngày

# weatherDataBy
source: Weather data by {provider} (CC BY 4.0)
be: Даныя надвор'я ад {provider} (CC BY 4.0)
bn: {provider} থেকে আবহাওয়া ডেটা (CC BY 4.0)
el: Δεδομένα καιρού από {provider} (CC BY 4.0)
hi: {provider} से मौसम डेटा (CC BY 4.0)
is: Veðurgögn frá {provider} (CC BY 4.0)
ka: ამინდის მონაცემები {provider}-დან (CC BY 4.0)
ko: {provider} 날씨 데이터 (CC BY 4.0)
mk: Податоци за времето од {provider} (CC BY 4.0)
pa: {provider} ਤੋਂ ਮੌਸਮ ਡਾਟਾ (CC BY 4.0)
ro: Date meteo de la {provider} (CC BY 4.0)
sq: Të dhënat e motit nga {provider} (CC BY 4.0)
ta: {provider} வானிலை தரவு (CC BY 4.0)
uk: Дані погоди від {provider} (CC BY 4.0)
vi: Dữ liệu thời tiết từ {provider} (CC BY 4.0)

source: Daylight derived
be: Дзённае святло разлічана
bn: দিনের আলো গণনাকৃত
el: Φως ημέρας υπολογισμένο
hi: दिन का प्रकाश गणना
is: Dagsbirta reiknuð
ka: დღის სინათლე გამოთვლილი
ko: 일광 계산값
mk: Дневна светлина пресметана
pa: ਦਿਨ ਦੀ ਰੌਸ਼ਨੀ ਗਣਨਾ
ro: Lumina zilei calculată
sq: Drita e ditës e llogaritur
ta: பகல் ஒளி கணக்கிடப்பட்டது
uk: Денне світло розраховано
vi: Ánh sáng tính toán

# sourceCode
source: Open source on GitHub (BSL 1.1)
be: Адкрыты код на GitHub (BSL 1.1)
el: Ανοιχτός κώδικας στο GitHub
hi: GitHub पर ओपन सोर्स (BSL 1.1)
is: Opinn kóði á GitHub (BSL 1.1)
ko: Open source on GitHub
mk: Отворен код на GitHub
pa: GitHub 'ਤੇ ਓਪਨ ਸੋਰਸ (BSL 1.1)
sq: Kod i hapur në GitHub (BSL 1.1)
vi: Mã nguồn mở trên GitHub (BSL 1.1)

# offlineRefreshError
source: Unable to refresh - showing cached data
be: Немагчыма абнавіць - паказваюцца кэшаваныя даныя
bn: রিফ্রেশ করা যাচ্ছে না - ক্যাশ করা ডেটা দেখানো হচ্ছে
el: Αδυναμία ανανέωσης - εμφανίζονται αποθηκευμένα δεδομένα
hi: रीफ्रेश नहीं हो सका - कैश्ड डेटा दिखाया जा रहा है
is: Ekki tókst að uppfæra - sýni vistuð gögn
ka: განახლება ვერ მოხერხდა - ნაჩვენებია ქეშირებული მონაცემები
ko: 새로고침 불가 - 캐시된 데이터 표시 중
mk: Не може да се освежи - се прикажуваат кеширани податоци
pa: ਤਾਜ਼ਾ ਨਹੀਂ ਹੋ ਸਕਦਾ - ਕੈਸ਼ ਕੀਤਾ ਡਾਟਾ ਦਿਖਾ ਰਿਹਾ ਹੈ
ro: Nu se poate reîmprospăta - se afișează date din cache
sq: Nuk mund të rifreskoj - po shfaq të dhëna të ruajtura
ta: புதுப்பிக்க இயலவில்லை - தற்காலிகமாக சேமிக்கப்பட்ட தரவைக் காட்டுகிறது
uk: Не вдалося оновити - показуються кешовані дані
vi: Không thể làm mới - hiển thị dữ liệu đã lưu

source: Loading weather...
be: Загрузка надвор'я...
bn: আবহাওয়া লোড হচ্ছে...
el: Φόρτωση καιρού...
hi: मौसम लोड हो रहा है...
is: Hleð veðri...
ka: ამინდის ჩატვირთვა...
ko: 날씨 로딩 중...
mk: Се вчитува времето...
pa: ਮੌਸਮ ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...
ro: Se încarcă vremea...
sq: Duke ngarkuar motin...
ta: வானிலை ஏற்றப்படுகிறது...
uk: Завантаження погоди...
vi: Đang tải thời tiết...

source: Unable to load weather
be: Немагчыма загрузіць надвор'е
bn: আবহাওয়া লোড করা যাচ্ছে না
el: Αδυναμία φόρτωσης καιρού
hi: मौसम लोड नहीं हो सका
is: Ekki tókst að hlaða veðri
ka: ამინდის ჩატვირთვა ვერ მოხერხდა
ko: 날씨를 불러올 수 없음
mk: Не може да се вчита времето
pa: ਮੌਸਮ ਲੋਡ ਨਹੀਂ ਹੋ ਸਕਦਾ
ro: Nu se poate încărca vremea
sq: Nuk mund të ngarkoj motin
ta: வானிலையை ஏற்ற இயலவில்லை
uk: Не вдалося завантажити погоду
vi: Không thể tải thời tiết

# unknownLocation
source: Unknown
be: Невядома
bn: অজানা
el: Άγνωστο
hi: अज्ञात
is: Óþekkt
ka: უცნობი
ko: 알 수 없음
mk: Непознато
pa: ਅਣਜਾਣ
ro: Necunoscut
sq: E panjohur
ta: தெரியாத
uk: Невідомо
vi: Không xác định

# gpsPermissionDenied
source: GPS permission denied. Enable in device settings.
be: Дазвол GPS адхілены. Уключыце ў наладах прылады.
bn: GPS অনুমতি অস্বীকৃত। ডিভাইস সেটিংসে সক্ষম করুন।
el: Η άδεια GPS απορρίφθηκε. Ενεργοποιήστε στις ρυθμίσεις.
hi: GPS अनुमति अस्वीकृत। डिवाइस सेटिंग्स में सक्षम करें।
is: GPS heimild hafnað. Virkja í stillingar tækis.
ka: GPS ნებართვა უარყოფილია. ჩართეთ მოწყობილობის პარამეტრებში.
ko: GPS 권한이 거부되었습니다. 기기 설정에서 활성화하세요.
mk: GPS дозволата е одбиена. Овозможете во поставките.
pa: GPS ਇਜਾਜ਼ਤ ਰੱਦ। ਡਿਵਾਈਸ ਸੈਟਿੰਗਾਂ ਵਿੱਚ ਯੋਗ ਕਰੋ।
ro: Permisiunea GPS refuzată. Activați din setările dispozitivului.
sq: Leja GPS u refuzua. Aktivizoni në cilësimet e pajisjes.
ta: GPS அனுமதி மறுக்கப்பட்டது. சாதன அமைப்புகளில் இயக்கவும்.
uk: Дозвіл GPS відхилено. Увімкніть у налаштуваннях пристрою.
vi: Quyền GPS bị từ chối. Bật trong cài đặt thiết bị.

# searchConnectionError
source: Unable to search - check your connection
be: Немагчыма шукаць - праверце падключэнне
bn: অনুসন্ধান করা যাচ্ছে না - আপনার সংযোগ পরীক্ষা করুন
el: Αδυναμία αναζήτησης - ελέγξτε τη σύνδεση
hi: खोज नहीं हो सकी - अपना कनेक्शन जांचें
is: Ekki tókst að leita - athugaðu tengingu
ka: ძიება ვერ მოხერხდა - შეამოწმეთ კავშირი
ko: 검색 불가 - 연결을 확인하세요
mk: Не може да се пребарува - проверете ја врската
pa: ਖੋਜ ਨਹੀਂ ਹੋ ਸਕਦੀ - ਆਪਣਾ ਕਨੈਕਸ਼ਨ ਚੈੱਕ ਕਰੋ
ro: Nu se poate căuta - verificați conexiunea
sq: Nuk mund të kërkoj - kontrolloni lidhjen
ta: தேட இயலவில்லை - இணைப்பைச் சரிபார்க்கவும்
uk: Не вдалося знайти - перевірте підключення
vi: Không thể tìm kiếm - kiểm tra kết nối của bạn

source: Select Location
be: Выбраць месца
bn: অবস্থান নির্বাচন করুন
el: Επιλογή τοποθεσίας
hi: स्थान चुनें
is: Veldu staðsetningu
ka: აირჩიეთ მდებარეობა
ko: 위치 선택
mk: Изберете локација
pa: ਟਿਕਾਣਾ ਚੁਣੋ
ro: Selectați locația
sq: Zgjidhni vendndodhjen
ta: இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்
uk: Оберіть місце
vi: Chọn vị trí

# searchCityHint
source: Search city...
be: Пошук горада...
bn: শহর খুঁজুন...
el: Αναζήτηση πόλης...
hi: शहर खोजें...
is: Leita að borg...
ka: მოძებნე ქალაქი...
ko: 도시 검색...
mk: Пребарај град...
pa: ਸ਼ਹਿਰ ਲੱਭੋ...
ro: Căutați oraș...
sq: Kërko qytet...
ta: நகரத்தைத் தேடு...
uk: Пошук міста...
vi: Tìm thành phố...
